#Demonstração Pandas
###Disciplina - Introdução a Ciência de Dados - Univesp
###Videoaula 6
###Prof. Dr. José Eduardo Santarem Segundo
**Aluno: Aelso Rocha Brito**
##**notebook**ComAnotaçõesDaVideoaula

#Importar Bibliotecas

In [ ]:
import pandas as pd
import numpy as np

#Series (observe o índice do lado esquerdo)

***SERIES***
###Objeto do tipo array unidimensional contendo uma sequência de valores e um array associado de rótulos (labels) de dados chamado de índice.
###A representação em string de uma Series mostra índices à esquerda e valores à direita (vamos ver na demonstração).
###Diferente do NumPy, nas Series podemos ter rótulos nos índices.

In [ ]:
s1=pd.Series([1,2,-5,0])

In [ ]:
s1

0    1
1    2
2   -5
3    0
dtype: int64

No Resultando vemos a primeira coluna que é indice seguindo pelos seu valor

In [ ]:
s1.values

array([ 1,  2, -5,  0])

A função **values** mostra os valores dos **Series**

In [ ]:
s1.index

RangeIndex(start=0, stop=4, step=1)

A função **index** mostra os indices dos **Series**

In [ ]:
s2=pd.Series([1,2,-5,0], index=['a','b', 'c', 'd'])

A variável **s2** vai recebe **Series** e vai alterar o indíce de  valor númerico por  indice estabelecido pelo programador.

In [ ]:
s2

a    1
b    2
c   -5
d    0
dtype: int64

Isso significa para acessar os valores agora usamos as letras**[a,b,c,d]**

In [ ]:
s2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

Fazendo atribuição: na posição **a** atribuimos o valor **1000**

In [ ]:
s2['a']=1000

In [ ]:
s2

a    1000
b       2
c      -5
d       0
dtype: int64

#Comparação

Varremos a Series para procurar os valores **>** (Maior) **0**.

In [ ]:
s2[s2>0]

a    1000
b       2
dtype: int64

Apenas **a** e **b**  tem valores maiores que 0.

#Algebra

**Multiplicação**

In [ ]:
s2*2

a    2000
b       4
c     -10
d       0
dtype: int64

**Lembrado** que quando fazemos a multiplicação não fazemos alteração no valor interno, ou seja, os valores da **Series** continuam o mesmo.

In [ ]:
s2

a    1000
b       2
c      -5
d       0
dtype: int64

A função **isnull** verifica se existem valores nulo. retorna valores booleanos: **True**(verdadeiro) para valores nulo ou **False(falso)** para valores **Não Nulo**

In [ ]:
s2.isnull()

a    False
b    False
c    False
d    False
dtype: bool

#Dataframe

###Representa uma **tabela de dados retangular** e **contém** uma **coleção ordenada** de colunas, em que cada uma pode ter um **tipo** de valor diferente **(booleano, string, numérico, entre outros)**.
###O **Dataframe** tem **índice** tanto para **linha** quanto para **coluna**, **podendo** ser imaginado como um **dicionário (dict)** de Series, todos compartilhando o mesmo índice.
###A **capacidade** de trabalhar com **vários tipos de dados**, **como** se fosse uma **tabela de banco de dados**, **favorece** consideravelmente o **trabalho** de um profissional de **DS**.

#Criar Dataframe

A variável dados recebe os estados[SP,PR,....] **label** 'estado', o **ano**[2019,2019,...] **label** 'ano' e população[45.9,21.2,...] **label** 'pop'

In [ ]:
dados={'estado':['SP', 'MG','PR','SP','MG','PR'], 'ano':[2019, 2019,2019, 2020,2020,2020], 'pop':[45.9, 21.2,16.9,46.6,21.4,17.3]}
df1=pd.DataFrame(dados)

In [ ]:
df1

  estado   ano   pop
0     SP  2019  45.9
1     MG  2019  21.2
2     PR  2019  16.9
3     SP  2020  46.6
4     MG  2020  21.4
5     PR  2020  17.3

O comando **head** mostra o registro do dataframe indicado pelo programado. Nesse caso seria mostrado os 2 primeiros registros.

In [ ]:
df1.head(2)

  estado   ano   pop
0     SP  2019  45.9
1     MG  2019  21.2

#Visualizar partes Dataframe

O comando **tail**  mostra o(s) registro(s) final(is). Nesse caso 2 últimos registros.

In [ ]:
df1.tail(2)

  estado   ano   pop
4     MG  2020  21.4
5     PR  2020  17.3

O comando **sample** mostra(m) registro(s) aleatório(s).Nesse caso 2  registros.

In [ ]:
df1.sample(2)

  estado   ano   pop
0     SP  2019  45.9
2     PR  2019  16.9

#Novo DF a partir o anterior (veja as colunas)

Podemos gerar novo(s) dataframe apartir do anterior

Aqui vou gerar o mesmo dataframe só que com uma sequência da **coluna diferente**

In [ ]:
df2=pd.DataFrame(dados,columns=['ano','estado','pop'])

In [ ]:
df2

    ano estado   pop
0  2019     SP  45.9
1  2019     MG  21.2
2  2019     PR  16.9
3  2020     SP  46.6
4  2020     MG  21.4
5  2020     PR  17.3

#Observar DF

Podemos observar informações do dataframe de forma separada.

Observando as informações dos **'estado'** no Dataframe **df2**.

In [ ]:
df2['estado']

0    SP
1    MG
2    PR
3    SP
4    MG
5    PR
Name: estado, dtype: object

Observando as informações dos **'ano'** no Dataframe df2.

In [ ]:
df2.ano

0    2019
1    2019
2    2019
3    2020
4    2020
5    2020
Name: ano, dtype: int64

O comando **dtypes** verificar os tipos dos dados do dataframe.

In [ ]:
df2.dtypes

ano         int64
estado     object
pop       float64
dtype: object

#Atribuir Valores

In [ ]:
df2['estimativa']=50

In [ ]:
df2

    ano estado   pop  estimativa
0  2019     SP  45.9          50
1  2019     MG  21.2          50
2  2019     PR  16.9          50
3  2020     SP  46.6          50
4  2020     MG  21.4          50
5  2020     PR  17.3          50

Agora vamos gerar **registro** com comando **arange**. **lembrando que a quantidade de registro(s) tem ser do mesmo tamanho.

In [ ]:
df2['estimativa']=np.arange(6)

Atribuindo os valores

In [ ]:
df2

    ano estado   pop  estimativa
0  2019     SP  45.9           0
1  2019     MG  21.2           1
2  2019     PR  16.9           2
3  2020     SP  46.6           3
4  2020     MG  21.4           4
5  2020     PR  17.3           5

Criando um dataframe apatir de outro. **df3** recebe **df2**.

In [ ]:
df3=df2

In [ ]:
df3

    ano estado   pop  estimativa
0  2019     SP  45.9           0
1  2019     MG  21.2           1
2  2019     PR  16.9           2
3  2020     SP  46.6           3
4  2020     MG  21.4           4
5  2020     PR  17.3           5

O dataframe **df3** recebe o recorte do dataframe **df2**.

In [ ]:
df3=df2['ano']

In [ ]:
df3

0    2019
1    2019
2    2019
3    2020
4    2020
5    2020
Name: ano, dtype: int64

Vamos pega um dataframe original, criar uma nova coluna para toda a estrutura chamada**'Não Paraná'**. Vamos comparar toda a estrutura e encontrar estado 'PR'. A coluna **'Não Paraná'** recebe o resultado da comparação. o resultado são valores booleanos: **True**(verdadeiro) para **valores igual** a 'PR' ou **False(falso)** para valores diferente de **'PR'**

In [ ]:
df2['Não Paraná']=df2.estado!='PR'

In [ ]:
df2

    ano estado   pop  estimativa  Não Paraná
0  2019     SP  45.9           0        True
1  2019     MG  21.2           1        True
2  2019     PR  16.9           2       False
3  2020     SP  46.6           3        True
4  2020     MG  21.4           4        True
5  2020     PR  17.3           5       False

#Excluir Coluna

O Comando **del** vai excluir o(s) valor(es) da coluna.

In [ ]:
del df2['Não Paraná']

In [ ]:
df2

    ano estado   pop  estimativa
0  2019     SP  45.9           0
1  2019     MG  21.2           1
2  2019     PR  16.9           2
3  2020     SP  46.6           3
4  2020     MG  21.4           4
5  2020     PR  17.3           5

#Entender o DataFrame

O Comando **shape** mostra o tamanho do dataframe.Caso abaixo 6 linha com 4 colunas

In [ ]:
df2.shape

(6, 4)

Caso queriamos conta a quantidade de linha(s)(registro(s)) usamos a função **shape** retornado o primeiro valor**[00]** que referente a quantidade de linha.

In [ ]:
df2.shape[0]

6

Quando queremos fazer o tamanho do indíce usamos o Comando **index** para mostra.Caso abaixo o indíce começa no **0** e vai terminar no **6**.

In [ ]:
df2.index

RangeIndex(start=0, stop=6, step=1)

o Comando **columns** mostra os rótulos das **colunas** do DataFrame

In [ ]:
df2.columns

Index(['ano', 'estado', 'pop', 'estimativa'], dtype='object')

O comando **count** faz contagem células **non-NA**(não nulo(s)) para cada coluna ou linha do DataFrame.

In [ ]:
df2.count()

ano           6
estado        6
pop           6
estimativa    6
dtype: int64

#Alterar Informação das Colunas

Na próxima linha, vamos pega um dataframe já existente e vamos recriar/ alterando os nomes da colunas(**label**).

In [ ]:
df2.columns=['Ano','estado','Populacao','estimativa']

In [ ]:
df2

    Ano estado  Populacao  estimativa
0  2019     SP       45.9           0
1  2019     MG       21.2           1
2  2019     PR       16.9           2
3  2020     SP       46.6           3
4  2020     MG       21.4           4
5  2020     PR       17.3           5

#Analisar o DataFrame

O comando **describe** :
##Gerar estatísticas descritivas.

As **estatísticas descritivas** incluem aquelas que resumem a **tendência central, a dispersão e a forma da distribuição de um conjunto de dados, excluindo os valores NaN**.

**Analisa séries numéricas e de objetos**, bem como conjuntos de colunas DataFrame de tipos de dados mistos. A saída irá variar dependendo do que é fornecido.

In [ ]:
df2.describe(include='all')

                Ano estado  Populacao  estimativa
count      6.000000      6   6.000000    6.000000
unique          NaN      3        NaN         NaN
top             NaN     MG        NaN         NaN
freq            NaN      2        NaN         NaN
mean    2019.500000    NaN  28.216667    2.500000
std        0.547723    NaN  14.096725    1.870829
min     2019.000000    NaN  16.900000    0.000000
25%     2019.000000    NaN  18.275000    1.250000
50%     2019.500000    NaN  21.300000    2.500000
75%     2020.000000    NaN  39.775000    3.750000
max     2020.000000    NaN  46.600000    5.000000

#Alterar valores e  consultar dados

Abaixo vamos pegar o ano e **soma 2**.

In [ ]:
df2['Ano']=df2['Ano']+2

In [ ]:
df2

    Ano estado  Populacao  estimativa
0  2021     SP       45.9           0
1  2021     MG       21.2           1
2  2021     PR       16.9           2
3  2022     SP       46.6           3
4  2022     MG       21.4           4
5  2022     PR       17.3           5

Abaixo Mostramos os valores que são **maiores** [>] que 2021.

In [ ]:
df2[df2['Ano']>2021]

    Ano estado  Populacao  estimativa
3  2022     SP       46.6           3
4  2022     MG       21.4           4
5  2022     PR       17.3           5

In [ ]:
df4=df2[df2['Ano']>2021]

In [ ]:
df4

    Ano estado  Populacao  estimativa
3  2022     SP       46.6           3
4  2022     MG       21.4           4
5  2022     PR       17.3           5

#Excluir Colunas

O comando **drop**:
##Remove os rótulos especificados das linhas ou colunas.

**Remova linhas ou colunas especificando nomes** de **rótulos e eixos** correspondentes ou especificando diretamente nomes de índices ou colunas. Ao usar um índice múltiplo, os rótulos em diferentes níveis podem ser removidos especificando o nível.

**OBS**: Quando fazemos esse tipo de processo é importante observer o que execução e o atribuição.

**Execução**

In [ ]:
df4.drop('Ano', axis='columns')

  estado  Populacao  estimativa
3     SP       46.6           3
4     MG       21.4           4
5     PR       17.3           5

In [ ]:
df4

    Ano estado  Populacao  estimativa
3  2022     SP       46.6           3
4  2022     MG       21.4           4
5  2022     PR       17.3           5

In [ ]:
df2

    Ano estado  Populacao  estimativa
0  2021     SP       45.9           0
1  2021     MG       21.2           1
2  2021     PR       16.9           2
3  2022     SP       46.6           3
4  2022     MG       21.4           4
5  2022     PR       17.3           5

**Atribuição**
*inplace=True* executar alteração.

In [ ]:
df2.drop('Ano', axis='columns', inplace=True)

In [ ]:
df2

  estado  Populacao  estimativa
0     SP       45.9           0
1     MG       21.2           1
2     PR       16.9           2
3     SP       46.6           3
4     MG       21.4           4
5     PR       17.3           5

#Excluir Linhas

In [ ]:
df2.drop([0,1])

  estado  Populacao  estimativa
2     PR       16.9           2
3     SP       46.6           3
4     MG       21.4           4
5     PR       17.3           5

In [ ]:
df2

  estado  Populacao  estimativa
0     SP       45.9           0
1     MG       21.2           1
2     PR       16.9           2
3     SP       46.6           3
4     MG       21.4           4
5     PR       17.3           5

###Observe a propagação na exclusão definitiva

**dflinhas** recebe o dataframe **df2**

In [ ]:
dflinhas=df2

Abaixo vamos **apagar[drop + inplace true]** a linha.

In [ ]:
dflinhas.drop([0,1],inplace=True)

Como **dflinhas** recebe os valores de **df2**. a visualizar vemos que a linha foi apagada.

In [ ]:
dflinhas

  estado  Populacao  estimativa
2     PR       16.9           2
3     SP       46.6           3
4     MG       21.4           4
5     PR       17.3           5

In [ ]:
df2

  estado  Populacao  estimativa
2     PR       16.9           2
3     SP       46.6           3
4     MG       21.4           4
5     PR       17.3           5

#Ver Dados de linhas

O comando **iloc**:
**Indexação** puramente baseada em localização de **números inteiros** para **seleção por posição**.

In [ ]:
df2.iloc[0]

estado          PR
Populacao     16.9
estimativa       2
Name: 2, dtype: object

Se quisemos mostra a posição de **1** a **3**. Lembrado que mostra a segunda posição até 3.

In [ ]:
df2.iloc[1:3]

  estado  Populacao  estimativa
3     SP       46.6           3
4     MG       21.4           4

In [ ]:
df2.iloc[1:3,[1,2]]

   Populacao  estimativa
3       46.6           3
4       21.4           4

In [ ]:
df2

  estado  Populacao  estimativa
2     PR       16.9           2
3     SP       46.6           3
4     MG       21.4           4
5     PR       17.3           5